# Other Installs:
# `gh extension install dlvhdr/gh-dash`
#
#
# install all packages by running:
# > brew bundle --v


# 'brew install'
brew "git"
brew "tmux"
brew "youtube-dl"
brew "zoxide"
brew "lazygit"
brew "lazydocker"
brew "pyenv"
brew "pyenv-virtualenv"
brew "htop"
brew "git-delta"
brew "fzf"
brew "nnn"
brew "neovim"
brew "fd"
brew "eza"
brew "lua"
brew "aws-cli"
brew "stow"
brew "tldr"
brew "jq"
brew "tree"
brew "ripgrep"
brew "tree-sitter"
brew "gnu-sed"
brew "gnu-tar"
brew "gh"
brew "glab"
brew "duf"
brew "dust"
brew "xh"
brew "pandoc"
brew "fontconfig"
brew "font-hack-nerd-font"
# cask "font-iosevka"

# 'brew install --cask'
cask "iterm2"
cask "keepassxc"
cask "tunnelblick"
cask "rectangle"
